{
    "entries": [
        {
            "quote": "I woke up to my entire house under 2-3 inches of water, let me tell you, what a nightmare! When I finally calmed down I did my research and called around to several companies, no one was willing to work with my insurance company or I had to pay a hefty out of pocket fee on top of my already high insurance deductible, that was until I found out about RAPID RESPONSE, these guys are fast, efficient, didn't even try to upsell me on anything, I was almost shocked! They will make sure your house is BETTER off then before you had a river running through it! Thank you Rapid Response!! :)",
            "img": "/assets/images/logos/logo-15.svg",
            "avatar": "/assets/images/profile-small-2.jpeg",
            "name": "Gannon Ryan",
            "location": "Barstow, CA"
        },
        {
            "quote": "We came home late at night from vacation to find our house had flooded while we were gone! We called Rapid Response and they got to our house within 45 minutes. It was super late, but they showed up immediately and got all the water cleared out. They worked with our insurance and took care of us from start to finish. They made the process so easy and painless for us. Thank you to the staff for taking care of our home!",
            "img": "/assets/images/logos/logo-16.svg",
            "avatar": "/assets/images/profile-small-3.jpeg",
            "name": "Alexus Cloyd",
            "location": "Victorville, CA"
        },
        {
            "quote": "We had Rapid Response Flood Restoration come out when our home flooded, and they made the process so easy! They worked hand and hand with my insurance company and were able to get my house taken care of. Thank you guys again for everything! Would absolutely recommend this company!!!",
            "img": "/assets/images/logos/logo-17.svg",
            "avatar": "/assets/images/profile-small-4.jpeg",
            "name": "Erica Shaughnessy",
            "location": "Big Bear, CA"
        },
        {
            "quote": "Cannot thank these guys enough came home from a weekend vacation to water coming out of my front door I looked up a flood restoration company and loved seeing their 5 stars they came out at 12am on a Sunday night worked right with my insurance company and was able to repair my home thank you again rapid response.",
            "img": "/assets/images/logos/logo-17.svg",
            "avatar": "/assets/images/profile-small-4.jpeg",
            "name": "Yung Zo",
            "location": "California"
        },
        {
            "quote": "I needed emergency flood service fast so I searched on google. I found rapid response and called them since they had good reviews. I was not let down they showed up fast and removed all the water from my home and were able to save my stuff from being damaged. They left equipment and dried my home up and were gone in a few days.",
            "img": "/assets/images/logos/logo-17.svg",
            "avatar": "/assets/images/profile-small-4.jpeg",
            "name": "Cody Megginson",
            "location": "California"
        },
        {
            "quote": "Great company love the way you guys take care of business.thank you so much. Workers were very friendly. and very respectful.i definitely would use this company again.",
            "img": "/assets/images/logos/logo-17.svg",
            "avatar": "/assets/images/profile-small-4.jpeg",
            "name": "Anthony Hodge",
            "location": "California"
        },
        {
            "quote": "This company showed up when our home was flooded front to back. They came in and removed all the water...dried it and then had the kitchen completely rebuilt we are so grateful for these guys! They had us all done before this holiday season! They worked with our insurance company. Thank you so much Rapid Response! We HIGHLY RECOMMEND THEM!!!!!",
            "img": "/assets/images/logos/logo-17.svg",
            "avatar": "/assets/images/profile-small-4.jpeg",
            "name": "Jacob H",
            "location": "California"
        },
        {
            "quote": "You never understand what's going to happen untill a leak happens to you. And it did we were out of town on vacation and our neighbor called me and said there was water running down my driveway we rushed home and found out the water heater line sprung a leak we called Rapid Response Flood restoration Josiah answered first ring and helped us through the entire dry out process, repairs and was very professional highly recommended Rapid Response Flood restoration what a great team 👏",
            "img": "/assets/images/logos/logo-17.svg",
            "avatar": "/assets/images/profile-small-4.jpeg",
            "name": "James Weatherby",
            "location": "Weatherby Construction"
        },
        {
            "quote": "We had Rapid Response Flood Restoration come out when our home flooded, and they made the process so easy! They worked hand and hand with my insurance company and were able to get my house taken care of. Thank you guys again for everything! Would absolutely recommend this company!!!",
            "img": "/assets/images/logos/logo-17.svg",
            "avatar": "/assets/images/profile-small-4.jpeg",
            "name": "Erica Tren",
            "location": "Ontario, CA"
        },
        {
            "quote": "I had an issue with a burst pipe in my home. Unfortunately I was at work so it had been going on for a while. I called Rapid Response and they were to my home in 30 minutes. It was pretty late so I was grateful for them getting there so fast. I highly recommend them to anyone.",
            "img": "/assets/images/logos/logo-17.svg",
            "avatar": "/assets/images/profile-small-4.jpeg",
            "name": "Calvin Franklin",
            "location": "California"
        }
    ]
}